#ifndef __CONFIG_H__ 
#define __CONFIG_H__

#include "type.h"
#include "iostm8s103f3.h"

/****************************************************************************
*                           系统时钟设置                                     *
****************************************************************************/
#define Fosc            	16000000UL  						//应当与实际晶振频率一至					    
#define Fmaster         	16000000UL							//总线时钟
#define Fcpu				16000000UL							//内核时钟
						    
/****************************************************************************
*                           其他参数设置项                                   *
****************************************************************************/
#define SYSCLK_INIT()		CLK_CKDIVR  = 0x00;	\
							CLK_PCKENR1 = 0;	\
							CLK_PCKENR2 = 0

#define TESTPIN_ON()		PD_ODR_ODR4 = 1
#define TESTPIN_OFF()		PD_ODR_ODR4 = 0

#define ITVFRE				500									//500Hz中断频率
#define T					(1.0L/ITVFRE - 0.0000001L)			//定时时间周期
#define PI					3.1415926L

/****************************************************************************
*                   		电机控制参数设置项                              	*
****************************************************************************/								
#define START_SPEED			120UL								//启动转速
#define STOP_SPEED			100UL								//停止转速
#define BASE_SPEED			90UL								//基准转速
							  
#define ACC_RATE			(uint16)(1400.0L/(1.0L/T))			//加速斜率	0-1400 加速1s		
#define DEC_RATE			(uint16)(1400.0L/(0.05L/T))			//减速斜率  1400-0  减速0.05s
							  
#define LOCKED_TIMEOUT		(uint16)(20.0L/T)					//堵转超时时间
#define LOCKED_BNC_TIMEOUT	(uint16)(1.2L/T)					//堵转恢复计时时间	
#define LOW_SPEED			60UL								//堵转报警阀值
								
/****************************************************************************
*                   		ADC参数设置项                              		*
****************************************************************************/
#define ADCBUF_NUM			16									//ADC采样结果缓存池大小
#define ADC_CVTMIN			10UL								//ADC转换最小阀值
#define ADC_CVTMAX			985UL								//ADC转换最大阀值
																			
/****************************************************************************
*                   	 速度检测模块参数设置项                               *
****************************************************************************/
#define SPD_K				32									//一阶滤波权重比
#define SPDFDB_NUM			32									//速度反馈缓存池最大值
#define MAX_SPEED			3200.0L								//最高转速
#define CYC_PULSE			12.0L								//每转产生的速度反馈脉冲数

/****************************************************************************
*                        可控硅触发输出参数设置项                             *
****************************************************************************/
#define MIN_TRIG_DLY		(uint16)((Fmaster/16UL)*0.001L)	//可控硅触发输出最小延时 1000us
#define MAX_TRIG_DLY		(uint16)((Fmaster/16UL)*0.008L)	//可控硅触发输出最大延时 8000us
#define TRIG_WIDTH			(uint16)((Fmaster/16UL)*0.0002L)	//可控硅触发输出脉冲宽度 200us
							

							

								
								
#endif
/*****************************************************************************************************
*                                      End Of File													 *
******************************************************************************************************/
